import React from 'react'
import styled from '@emotion/styled'

const Block = styled.div`
        margin-top : 30px;
    p, li {
        padding-bottom: 3px;
    }
    li{
        padding-left: 1.5em;
        text-indent: -0.6em;
    }
`

const CodeOfConductIndexPage = () => {
    return (
        <div>
            <Block>
                <h1>우리가 동의하는 디지털 정책은? 행동강령</h1>
                <h3>약속</h3>
                <h3>안심하고 토론하는 공론장을 만들어요.</h3>
                <ul>
                    <li>- 우리가 동의하는 디지털 정책은?’(이하 우동디)는 디지털 정책에 관심있는 사람들이 의견을 나눌 수 있는 안전한 공론장을 만들고자 합니다. 서로 다른 경험과 관점ㅁㅁ 을 존중하고, 다양한 논의가 잘 정리되며는 환경이 마련된다면. 논의가 확장되고 시민을 위한 디지털 정책 담론을 만드는데 기여할 것이라고 생각합니다.</li>
                    <li>- 같은 관점에서 효능감을 느낄 수 있는 공론장을 만들기 위해 이용자와 운영자는 우동디의 모든 공간에서 연령, 신체, 장애, 민족성, 성 정체성, 성적 지향, 경력, 국적, 외모, 인종 또는 종교에 관계 없이, 모두에게 차별 없이 참여할 것을 약속합니다.</li>
                    <li>- 우리는 서로 다른 배경과 지식을 가지고 있습니다. 의견의 불일치는 자연스러운 일입니다.비판과 비난은 다릅니다. 건설적인 비판은 커뮤니티와 구성원의 발전에 도움이 됩니다. 하지만 남을 깎아내리고 상처 주기 위한 목적의 비난은 금지됩니다. 상대방과 생각이 다르다면 정중하고 올바른 방법으로 의견을 이야기해주세요. 올바른 비판에는 관대하게 수용하는 자세를 가져주세요.</li>
                </ul>
            </Block>
            <Block>
                <h3>안전한 공론장을 조성하기 위해서 항상 다음과 같이 행동하기로 합니다.</h3>
                <ul>
                    <li>- 소외하지 않고 배려하는 언어 사용해주세요.</li>
                    <li>- 서로 다른 경험과 관점 존중해주세요.</li>
                    <li>- 열린 마음으로 건설적인 비판을 수용해주세요.</li>
                    <li>- 혐오와 차별 없이 대화해주세요.</li>
                    <li>- 사람이 아닌 내용을 비판해주세요.</li>
                    <li>- 내 지식을 과시하기 위해 다른 사람을 망신주지 마세요.</li>
                </ul>
            </Block>
            <Block>
                <h3>안전한 공론장을 위해 하지 말아야 할 행동은 다음과 같습니다.</h3>
                <ul>
                    <li>- 성적인 언어와 이미지 사용, 원치않는 성적 관심이나 접근</li>
                    <li>- 소모적인 논쟁, 모욕적이거나 비하하는 댓글과 개인적 또는 정치적인 공격</li>
                    <li>- 공개적이거나 개인적인 괴롭힘</li>
                    <li>- 동의없는 집주소 또는 전자주소 등의 개인 정보의 공개</li>
                    <li>- 부적절한 것으로 간주될 수 있는 다른 행위</li>
                </ul>
            </Block>
            <Block>
                <h3>책임</h3>
                <p>공론장 운영자는 허용되는 행동의 기준을 명확히 해야할 책임이 있습니다. 또한, 하지말아야 할 행동에 대해 적당하고 공정한 시정 조치를 위할 것 입니다. </p>
                <p>공론장 운영자는 이 행동 강령을 따르지 않은 댓글, 대댓글, 자료 위키 편집 그 외 다른 기여를 삭제, 수정 또는 거부할 권리와 책임이 있습니다. 또한, 부정당하거나 험악하거나 공경적이거나 해롭다고 생각하는 다른 행동을 한 참여자를 일시적 또는 영구적으로 퇴장시킬 수 있습니다. </p>
            </Block>
            <Block>
                <h3>범위</h3>
                <p>이 행동 강령은 우동디의 모든 영역에 적용되며, 우동디를 대표할 경우 공개 영역에도 적용됩니다. 우동디에서 위와 같은 책임을 가지고 활동하는 운영자가 있습니다. 우동디 운영자는 우동디 플랫폼 전반에 대해, 각각의 토론 주제들에 대해 책임을 가지고 행동강령 및 운영정책에 준하여 운영 활동을 합니다.</p>
            </Block>
            <Block>
                <h3>주의 깊게 읽어주세요</h3>
                <p>해서는 안 되는 일들의 전체 목록이 모두 여기에 담겨있지는 않습니다. 그보다는 이 행동 강령에 담긴 내용의 의도가 무엇인지 깊이 파악하고 서로에게 좀 더 잘 대할 수 있도록 해주는 가이드로 삼는 것이 중요합니다. 이 행동 강령을 문자 그대로 따르기보다 그 안에 담긴 의도를 파악하시고 행동해주실 것을 부탁드립니다.</p>
            </Block>
            <Block>
                <h3>이런 걸 참고했어요.</h3>
                <ul>
                    <li>- <a href="https://www.contributor-covenant.org/ko/version/1/4/code-of-conduct.html">기여자 규약</a> 의 1.4 버전</li>
                    <li>- 파이콘 한국 2021 행동 강령</li>
                </ul>
                <p>등을 우동디에 적합하게 변형하여 작성되었습니다.</p>
            </Block>
            <Block>
                <h1>운영정책</h1>
                <p>우동디<b>의 행동강령과 운영 정책에 위배되는 콘텐츠는 누구나 신고할 수 있습니다. 혹시 다른 이용자의 컨텐츠로 인해 피해를 입은 경우에도 알려주세요.</b></p>
                <p>신고가 필요한 경우, 아래 양식에 따라 작성해 메일로 보내 주세요. 우동디가 행동강령과 운영 정책, 서비스 이용약관에 따라 판단 후 처리하겠습니다. 각 콘텐츠에서 '신고'를 눌러 신고하실 수도 있습니다.</p>
                <p>삭제가 진행될 경우, 문제가 된 컨텐츠 게시자에게 메일 등의 방법으로 현황을 알리도록 하겠습니다.</p>
                <p>행동강령과 운영정책에 위배되는 콘텐츠를 반복적으로 올리거나 허위로 신고할 경우 해당 계정의 우동디 이용이 제한됩니다.</p>
            </Block>
            <Block>
                <p><b>다음과 같은 콘텐츠는 삭제하거나 이용을 제한합니다.</b></p>
                <ul>
                    <li>- 음란성, 광고성 콘텐츠</li>
                    <li>- 폭력적, 선정적이거나, 인신공격, 욕설, 모욕, 비방, 비하, 폄하, 조롱이 담긴 콘텐츠</li>
                    <li>- 개인정보 유포, 사생활 침해 등 개인의 명예를 훼손하는 내용이 포함된 콘텐츠</li>
                    <li>- 연령, 신체, 장애, 민족성, 성 정체성, 성적 지향, 경력, 국적, 외모, 인종 또는 종교에 대한 차별 혹은 혐오가 포함된 콘텐츠</li>
                    <li>- 동일한 내용으로 반복 등록된 콘텐츠</li>
                    <li>- 부적절하거나 광고성 코드 또는 URL이 삽입된 콘텐츠</li>
                    <li>- 기타, 어뷰징이 확인되거나 법률 및 이용약관에 위배되는 콘텐츠</li>
                    <li>- 다만, 생산적인 토의가 이뤄지고 있는 경우 토의를 공개하기 위해 제재가 보류될 수 있습니다.</li>
                </ul>
            </Block>
        </div>
    )
}

export default CodeOfConductIndexPage
